// const dataAll = [
//   {
//     message:
//       "📣📢กำหนดการตารางสอบปลายภาค 🔰ภาคการศึกษาที่ 1/2565 🌐https://reg.eng.cmu.ac.th/reg/files/2020/Final_exam_265.pdf -------------- ✌🏻✌🏻✌🏻✌🏻✌🏻✌🏻",
//     message_chars:
//       "กหนดกรตรงสอบปลยภคภคกรศกษทhttpsregengcmuacthregfilesFinalexampdf",
//     permalink_url:
//       "https://www.facebook.com/606863031228263/posts/606938377887395",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/311178657_583107393612892_209876676699943691_n.jpg?stp=dst-jpg_s720x720&_nc_cat=104&ccb=1-7&_nc_sid=8024bb&_nc_ohc=7OdmJZSfVCoAX8HZ6zH&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT9bKkIaqqO6Cph4WNOB-mdczAmPup72xJNtT0j8of0nrQ&oe=634731E1",
//     created_time_ms: 1665194154000,
//     created_time: "2022-10-08T01:55:54+0000",
//     id: "152483181547527_606938377887395",
//     facebook_page: "undergradTH",
//   },
//   {
//     message:
//       "กิจกรรมรับน้องขึ้นดอย | วันเสาร์ ที่ 𝟭𝟵 พ.ย.𝟮𝟱𝟲𝟱 --ความทรงจำดีดีจะกลับมาอีกครั้ง-- 🔴𝑾𝑬 𝑨𝑹𝑬 𝑨𝑳𝑳 𝑬𝑵𝑻𝑨𝑵𝑬𝑬𝑹 𝑪𝑴𝑼🟣 ---------- #𝐈𝐄 #𝐄𝐍𝐆 #𝐂𝐌𝐔 ⚙️",
//     message_chars: "กจกรรมรบนองขนดอยวนสรทพยควมทรงจดดจกลบมอกครง",
//     permalink_url:
//       "https://www.facebook.com/539183121543643/posts/539260194869269",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/310966805_468225022005317_4811956008995052157_n.jpg?stp=dst-jpg_p720x720&_nc_cat=104&ccb=1-7&_nc_sid=8024bb&_nc_ohc=p-xJTMRzdU0AX82b-VE&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT_VLvRPAgg88rITZVXdWfOSPm_yrUmXeB7kBq4Blui4aw&oe=63470ED6",
//     created_time_ms: 1665193280000,
//     created_time: "2022-10-08T01:41:20+0000",
//     id: "155178547881479_539260194869269",
//     facebook_page: "ie",
//   },
//   {
//     message: "",
//     message_chars: "",
//     permalink_url:
//       "https://www.facebook.com/495394315934621/posts/494824252658294",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t15.5256-10/310300405_5597887023628174_4549959171380438140_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=ad6a45&_nc_ohc=OJ6uSg_29jsAX-9wnu4&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT-L2HzFv9FSUBfep6R0Rbo7uA_Igsk3F8i4Y6fnXZ3H-Q&oe=634670A5",
//     created_time_ms: 1665133649000,
//     created_time: "2022-10-07T09:07:29+0000",
//     id: "1112284975464070_494824252658294",
//     facebook_page: "masterIM",
//   },
//   {
//     message:
//       "อาจารย์ไออี มช. มีครบทุกสไตล์ ใจดี เก่ง แถมหน้าตาดี สปอร์ต⭐️ อัฟเดททุกเรื่องราวเกี่ยวกับไออี ฝากติดตามเพจหลักบ้านไออีด้วยน้า 🌐https://www.facebook.com/iecmu",
//     message_chars:
//       "อจรยออมชมครบทกสตลจดกงถมหนตดสปอรตอฟดททกรองรวกยวกบออฝกตดตมพจหลกบนออดวยนhttpswwwfacebookcomiecmu",
//     permalink_url:
//       "https://www.facebook.com/606863031228263/posts/606292794618620",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/311092704_538376661624289_3661073887802199_n.jpg?stp=dst-jpg_s720x720&_nc_cat=110&ccb=1-7&_nc_sid=dd9801&_nc_ohc=l2SiKmr4CSoAX-XksVD&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT_BSRD-Pc-lKBHtPXp_O6iz3VfkCxrT8rjV2SBBFdVjuA&oe=63461D13",
//     created_time_ms: 1665130567000,
//     created_time: "2022-10-07T08:16:07+0000",
//     id: "152483181547527_606292794618620",
//     facebook_page: "undergradTH",
//   },
//   {
//     message: "คณาจารย์ภาควิชา IE CMU",
//     message_chars: "คณจรยภควชIECMU",
//     permalink_url:
//       "https://www.facebook.com/495394315934621/posts/494792245994828",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/311092704_538376661624289_3661073887802199_n.jpg?stp=dst-jpg_s720x720&_nc_cat=110&ccb=1-7&_nc_sid=dd9801&_nc_ohc=l2SiKmr4CSoAX-XksVD&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT_BSRD-Pc-lKBHtPXp_O6iz3VfkCxrT8rjV2SBBFdVjuA&oe=63461D13",
//     created_time_ms: 1665130527000,
//     created_time: "2022-10-07T08:15:27+0000",
//     id: "1112284975464070_494792245994828",
//     facebook_page: "masterIM",
//   },
//   {
//     message: "คณาจารย์ IE CMU",
//     message_chars: "คณจรยIECMU",
//     permalink_url:
//       "https://www.facebook.com/505887591552994/posts/505274281614325",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/311092704_538376661624289_3661073887802199_n.jpg?stp=dst-jpg_s720x720&_nc_cat=110&ccb=1-7&_nc_sid=dd9801&_nc_ohc=l2SiKmr4CSoAX-XksVD&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT_BSRD-Pc-lKBHtPXp_O6iz3VfkCxrT8rjV2SBBFdVjuA&oe=63461D13",
//     created_time_ms: 1665130424000,
//     created_time: "2022-10-07T08:13:44+0000",
//     id: "1022747451135009_505274281614325",
//     facebook_page: "grad",
//   },
//   {
//     message:
//       "จากบ้านไออี🏫หลังเล็กๆ เริ่มเปิดสอนในปี พ.ศ.2525 และจัดตั้งอย่างเป็นทางการในปี พ.ศ.2526 ไออีค่อยๆ เติบโต และดำเนินการสอน ถ่ายทอดความรู้ และประสบการณ์ มากว่า 40 ปี จนถึงปัจจุบัน . ภาควิชาวิศวกรรมอุตสาหาการ ปัจจุบันมีคณาจารย์ มากความรู้ ความสามารถ 👩🏻‍💼🧑🏻‍💼จำนวน 33 ท่าน พร้อมถ่ายทอดความรู้ ให้นักศึกษาในแบบฉบับ 𝗜𝗘 𝗖𝗠𝗨🤎 -------------------- 🔴𝘿𝙚𝙥𝙖𝙧𝙩𝙢𝙚𝙣𝙩 𝙤𝙛 𝙄𝙣𝙙𝙪𝙨𝙩𝙧𝙞𝙖𝙡 𝙀𝙣𝙜𝙞𝙣𝙚𝙚𝙧𝙞𝙣𝙜⚙️ 𝙁𝘢𝘤𝘶𝘭𝘵𝘺 𝘰𝘧 𝙀𝘯𝘨𝘪𝘯𝘦𝘦𝘳𝘪𝘯𝘨, 𝘾𝘩𝘪𝘢𝘯𝘨 𝙈𝘢𝘪 𝙐𝘯𝘪𝘷𝘦𝘳𝘴𝘪𝘵𝘺 --------------------- ⚙️ภาควิชาวิศวกรรมอุตสาหการ คณะวิศวกรรมศาสตร์ มหาวิทยาลัยเชียงใหม่ --------------------- #𝗜𝗘 #𝗘𝗡𝗚 #𝗖𝗠𝗨 ❤️",
//     message_chars:
//       "จกบนออหลงลกรมปดสอนนปพศลจดตงอยงปนทงกรนปพศออคอยตบตลดนนกรสอนถยทอดควมรูลปรสบกรณมกวปจนถงปจจบนภควชวศวกรรมอตสหกรปจจบนมคณจรยมกควมรูควมสมรถจนวนทนพรอมถยทอดควมรูหนกศกษนบบฉบบภควชวศวกรรมอตสหกรคณวศวกรรมศสตรมหวทยลยชยงหม",
//     permalink_url:
//       "https://www.facebook.com/539183121543643/posts/538407701621185",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/311092704_538376661624289_3661073887802199_n.jpg?stp=dst-jpg_s720x720&_nc_cat=110&ccb=1-7&_nc_sid=dd9801&_nc_ohc=l2SiKmr4CSoAX-XksVD&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT_BSRD-Pc-lKBHtPXp_O6iz3VfkCxrT8rjV2SBBFdVjuA&oe=63461D13",
//     created_time_ms: 1665129573000,
//     created_time: "2022-10-07T07:59:33+0000",
//     id: "155178547881479_538407701621185",
//     facebook_page: "ie",
//   },
//   {
//     message:
//       "ขอแสดงความยินดีกับผู้ช่วยศาสตราจารย์ ดร.ธัญญานุภาพ อานันทนะ อาจารย์สังกัดภาควิชาวิศวกรรมอุตสาหการ ได้รับแมอบหมายให้ปฏิบัติหน้าที่ : ผู้อำนวยการอุทยานวิทยาศาสตร์ภาคเหนือ",
//     message_chars:
//       "ขอสดงควมยนดกบผูชวยศสตรจรยดรธญญนภพอนนทนอจรยสงกดภควชวศวกรรมอตสหกรดรบมอบหมยหปฏบตหนทผูอนวยกรอทยนวทยศสตรภคหนอ",
//     permalink_url:
//       "https://www.facebook.com/495394315934621/posts/494639272676792",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/311458597_3404364143126344_492483491880296125_n.jpg?stp=dst-jpg_s720x720&_nc_cat=104&ccb=1-7&_nc_sid=8024bb&_nc_ohc=vk5b6Un20e8AX_rgNXF&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT-svFHJd4WSsPVN9Z3p3RCTD4__WkoQmB3mSOwRRAbZaQ&oe=63467FC2",
//     created_time_ms: 1665116426000,
//     created_time: "2022-10-07T04:20:26+0000",
//     id: "1112284975464070_494639272676792",
//     facebook_page: "masterIM",
//   },
//   {
//     message:
//       "ขอแสดงความยินดีกับผู้ช่วยศาสตราจารย์ ดร.ธัญญานุภาพ อานันทนะ อาจารย์สังกัดภาควิชาวิศวกรรมอุตสาหการ ได้รับแมอบหมายให้ปฏิบัติหน้าที่ : ผู้อำนวยการอุทยานวิทยาศาสตร์ภาคเหนือ",
//     message_chars:
//       "ขอสดงควมยนดกบผูชวยศสตรจรยดรธญญนภพอนนทนอจรยสงกดภควชวศวกรรมอตสหกรดรบมอบหมยหปฏบตหนทผูอนวยกรอทยนวทยศสตรภคหนอ",
//     permalink_url:
//       "https://www.facebook.com/505887591552994/posts/505133788295041",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/311458597_3404364143126344_492483491880296125_n.jpg?stp=dst-jpg_s720x720&_nc_cat=104&ccb=1-7&_nc_sid=8024bb&_nc_ohc=vk5b6Un20e8AX_rgNXF&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT-svFHJd4WSsPVN9Z3p3RCTD4__WkoQmB3mSOwRRAbZaQ&oe=63467FC2",
//     created_time_ms: 1665116283000,
//     created_time: "2022-10-07T04:18:03+0000",
//     id: "1022747451135009_505133788295041",
//     facebook_page: "grad",
//   },
//   {
//     message:
//       "⚙️ภาควิชาวิศวกรรมอุตสาหการ คณะวิศวกรรมศาสตร์ มหาวิทยาลัยเชียงใหม่ 👏🏻ขอแสดงความยินดีกับบุคลากร (ภาควิชาวิศวกรรมอุตสาหการ) 🎖 ผศ.ดร.ธัญญานุภาพ อานันทนะ ได้รับแต่งตั้งให้ดำรงตำแหน่ง ผู้อำนวยการอุทยานวิทยาศาสตร์ภูมิภาค (ภาคเหนือ) มีผลตั้งแต่วันที่ 4 ตุลาคม 2565 เป็นต้นไป #IE #ENG #CMU #วิศวกรรมอุตสาหการ",
//     message_chars:
//       "ภควชวศวกรรมอตสหกรคณวศวกรรมศสตรมหวทยลยชยงหมขอสดงควมยนดกบบคลกรภควชวศวกรรมอตสหกรผศดรธญญนภพอนนทนดรบตงตงหดรงตหนงผูอนวยกรอทยนวทยศสตรภูมภคภคหนอมผลตงตวนทตลคมปนตนปIEENGCMUวศวกรรมอตสหกร",
//     permalink_url:
//       "https://www.facebook.com/539183121543643/posts/538199221642033",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/311458597_3404364143126344_492483491880296125_n.jpg?stp=dst-jpg_s720x720&_nc_cat=104&ccb=1-7&_nc_sid=8024bb&_nc_ohc=vk5b6Un20e8AX_rgNXF&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT-svFHJd4WSsPVN9Z3p3RCTD4__WkoQmB3mSOwRRAbZaQ&oe=63467FC2",
//     created_time_ms: 1665110766000,
//     created_time: "2022-10-07T02:46:06+0000",
//     id: "155178547881479_538199221642033",
//     facebook_page: "ie",
//   },
//   {
//     message: "",
//     message_chars: "",
//     permalink_url:
//       "https://www.facebook.com/495394315934621/posts/494556349351751",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/310956375_494556329351753_1560420880981079292_n.jpg?stp=dst-jpg_p720x720&_nc_cat=101&ccb=1-7&_nc_sid=8024bb&_nc_ohc=eCgprZqjd_kAX8SISY6&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT9O7aTv3kfBOtflV87zx2fQaYlJHymvyydlmP41UqIJBA&oe=63472A7B",
//     created_time_ms: 1665108820000,
//     created_time: "2022-10-07T02:13:40+0000",
//     id: "1112284975464070_494556349351751",
//     facebook_page: "masterIM",
//   },
//   {
//     message: "",
//     message_chars: "",
//     permalink_url:
//       "https://www.facebook.com/505887591552994/posts/505058981635855",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/310919119_505058958302524_2517517542180542187_n.jpg?stp=dst-jpg_p720x720&_nc_cat=105&ccb=1-7&_nc_sid=8024bb&_nc_ohc=9cPXGFnJ6uMAX8Gnw8U&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT-ohOmnXs1eMIbW4Pe_eYjBPkjWz_4bRNX1fRcgDTBdSw&oe=634730F4",
//     created_time_ms: 1665108777000,
//     created_time: "2022-10-07T02:12:57+0000",
//     id: "1022747451135009_505058981635855",
//     facebook_page: "grad",
//   },
//   {
//     message:
//       "🏵️𝓒𝓸𝓷𝓰𝓻𝓪𝓽𝓾𝓵𝓪𝓽𝓲𝓸𝓷𝓼 ภาควิชาวิศวกรรมอุตสาหการ คณะวิศวกรรมศาสตร์ มหาวิทยาลัยเชียงใหม่ 👏🏻ขอแสดงความยินดีกับบุคลากร (ภาควิชาวิศวกรรมอุตสาหการ) 👨🏻‍💻ผศ.ดร.นิรันดร์ พิสุทธอานนท์ ได้รับทุนสนับสนุนการวิจัย จำนวน 500,000 เยน💴 เป็น 1 ใน 10 นักวิจัย ภายใต้ความร่วมมือ🤝 𝐂𝐌𝐔– 𝐌𝐮𝐫𝐚𝐭𝐚 𝐒𝐜𝐢𝐞𝐧𝐜𝐞 𝐅𝐨𝐮𝐧𝐝𝐚𝐭𝐢𝐨𝐧 𝐑𝐞𝐬𝐞𝐚𝐫𝐜𝐡 𝐆𝐫𝐚𝐧𝐭 สนับสนุนจำนวน 10 ทุน จำนวน 5,000,000 เยน . 🗓️วันอังคาร ที่ 4 ตุลาคม 2565 ⚙️คณะวิศวกรรมศาสตร์ มหาวิทยาลัยเชียงใหม่ 🎗️จัดพิธีรับมอบทุนสนับสนุน การวิจัยอันนำไปสู่การส่งเสริมวิทยาศาสตร์ เทคโนโลยีสำหรับอุตสาหกรรมเศรษฐกิจ และพัฒนาด้านสังคมของประเทศ ทุนวิจัยรวม จำนวน 5,000,000 เยน . จาก 👨🏻‍💼𝐌𝐫.𝐍𝐨𝐫𝐢𝐲𝐮𝐤𝐢 𝐊𝐮𝐛𝐨𝐝𝐞𝐫𝐚 𝑽𝒊𝒄𝒆 𝑷𝒓𝒆𝒔𝒊𝒅𝒆𝒏𝒕 𝒐𝒇 𝑴𝒖𝒓𝒂𝒕𝒂 𝑴𝒖𝒏𝒖𝒇𝒂𝒄𝒕𝒖𝒓𝒊𝒏𝒈 𝑪𝒐.,𝑳𝒕𝒅. 𝑹𝒆𝒑𝒓𝒆𝒔𝒆𝒏𝒕𝒂𝒕𝒊𝒗𝒆 𝒐𝒇 𝑴𝑺𝑭 . พร้อมด้วย 🧑🏻‍💼คุณบรรลือ ชื่นจิตกุลถาวร ผู้จัดการ บริษัท มูราตะ อิเล็คทรอนิกส์ (ประเทศไทย) จำกัด . และกรรมการบริษัทฯ . ร่วมเป็น สักขีพยาน ในโครงการ 🔴𝐓𝐡𝐞 𝐌𝐮𝐫𝐚𝐭𝐚 𝐒𝐜𝐢𝐞𝐧𝐜𝐞 𝐅𝐨𝐮𝐧𝐝𝐚𝐭𝐢𝐨𝐧 𝐑𝐞𝐬𝐞𝐚𝐫𝐜𝐡 𝐆𝐫𝐚𝐧𝐭 𝐟𝐨𝐫 𝐂𝐌𝐔🟣 . โดยมี 🎗️ศ.ดร.นายแพทย์พงษ์รักษ์ ศรีบัณฑิตมงคล (อธิการบดีมหาวิทยาลัยเชียงใหม่ ) เป็นประธานในพิธี . พร้อมด้วย รศ.ดร.วินิตา บุณโยดม (รองอธิการบดี) รศ.ดร.ธงชัย ฟองสมุทร (คณบดีคณะวิศวกรรมศาสตร์) . ร่วมรับมอบ ณ ห้องประชุมบัวเรศ คำทอง ชั้น 5 สำนักงานมหาวิทยาลัย 2 มหาวิทยาลัยเชียงใหม่ อ่านเพิ่มเติมได้ที่ https://eng.cmu.ac.th/?p=29686 #𝐂𝐌𝐔 #𝐄𝐍𝐆",
//     message_chars:
//       "ภควชวศวกรรมอตสหกรคณวศวกรรมศสตรมหวทยลยชยงหมขอสดงควมยนดกบบคลกรภควชวศวกรรมอตสหกรผศดรนรนดรพสทธอนนทดรบทนสนบสนนกรวจยจนวนยนปนนนกวจยภยตควมรวมมอสนบสนนจนวนทนจนวนยนวนองครทตลคมคณวศวกรรมศสตรมหวทยลยชยงหมจดพธรบมอบทนสนบสนนกรวจยอนนปสูกรสงสรมวทยศสตรทคนลยสหรบอตสหกรรมศรษฐกจลพฒนดนสงคมของปรทศทนวจยรวมจนวนยนจกพรอมดวยคณบรรลอชนจตกลถวรผูจดกรบรษทมูรตอลคทรอนกสปรทศทยจกดลกรรมกรบรษทรวมปนสกขพยนนครงกรดยมศดรนยพทยพงษรกษศรบณฑตมงคลอธกรบดมหวทยลยชยงหมปนปรธนนพธพรอมดวยรศดรวนตบณยดมรองอธกรบดรศดรธงชยฟองสมทรคณบดคณวศวกรรมศสตรรวมรบมอบณหองปรชมบวรศคทองชนสนกงนมหวทยลยมหวทยลยชยงหมอนพมตมดทhttpsengcmuacthp",
//     permalink_url:
//       "https://www.facebook.com/539183121543643/posts/537481101713845",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/310920763_537499615045327_6115088140608379290_n.jpg?stp=dst-jpg_s720x720&_nc_cat=111&ccb=1-7&_nc_sid=110474&_nc_ohc=BeygbIq6QF4AX_vj0Xe&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT_aIVjH3mpPB44TTWvoOHa9D4KhtyYaT0KeJWZ14zibbw&oe=63478B7D",
//     created_time_ms: 1665051984000,
//     created_time: "2022-10-06T10:26:24+0000",
//     id: "155178547881479_537481101713845",
//     facebook_page: "ie",
//   },
//   {
//     message: "เรื่องราวของมหาวิทยาลัยเชียงใหม่ จากอดีตสู่ปัจจุบัน",
//     message_chars: "รองรวของมหวทยลยชยงหมจกอดตสูปจจบน",
//     permalink_url:
//       "https://www.facebook.com/495394315934621/posts/493741462766573",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/310602466_466526795508473_4451620099383829749_n.jpg?stp=dst-jpg_s720x720&_nc_cat=106&ccb=1-7&_nc_sid=0be424&_nc_ohc=WPiIDdaFZJgAX86UOZO&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT-EKvxr7N0DAkS-l3FZdTx1IlIA8Qic1crwyNF1SagcQw&oe=6345EE72",
//     created_time_ms: 1665031512000,
//     created_time: "2022-10-06T04:45:12+0000",
//     id: "1112284975464070_493741462766573",
//     facebook_page: "masterIM",
//   },
//   {
//     message:
//       "📣พบกัน วันศุกร์ที่ 7 ตุลาคมนี้ !! ♠️เข้ารับชมงานฟรี ไม่มีขายบัตร ♦️ทุกท่านที่สนใจ สามารถเข้าร่วมงานได้ 🔹เตรียมตัวพบกับงานเทศกาลสุดยิ่งใหญ่อลังการ ของคณะวิศวกรรมศาสตร์ 🔸พบกับงานแสดงดนตรี การแสดงผู้นำเชียร์ และการแสดงต่างๆมากมาย ที่รอให้ทุกคนมาสัมผัสประสบการณ์ 🔹พร้อมกับ บูธขายอาหาร และบูธเล่นกิจกรรม ที่ร่วมด้วยช่วยกันจัดโดย นักศึกษาคณะวิศวกรรมศาสตร์ปีที่ 1 #Cinemaneer #1stEntaneerFestival #งานแสดงศักยภาพ65 #มาเดินเล่นที่คณะเรามั๊ย #ดูหนังผีจะทำให้กลัวถ้าอยากได้รักชัวๆให้ดูที่เรา #อย่ามาซ่าถ้ายังไม่เจอEntaneer65แบบพวกเรา #Entaneer65",
//     message_chars:
//       "พบกนวนศกรทตลคมนขรบชมงนฟรมมขยบตรทกทนทสนจสมรถขรวมงนดตรยมตวพบกบงนทศกลสดยงหญอลงกรของคณวศวกรรมศสตรพบกบงนสดงดนตรกรสดงผูนชยรลกรสดงตงมกมยทรอหทกคนมสมผสปรสบกรณพรอมกบบูธขยอหรลบูธลนกจกรรมทรวมดวยชวยกนจดดยนกศกษคณวศวกรรมศสตรปทCinemaneerstEntaneerFestivalงนสดงศกยภพมดนลนทคณรมยดูหนงผจทหกลวถอยกดรกชวหดูทรอยมซถยงมจอEntaneerบบพวกรEntaneer",
//     permalink_url:
//       "https://www.facebook.com/539183121543643/posts/537230501738905",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/310353683_126439396848395_6313651510894082512_n.jpg?stp=dst-jpg_s720x720&_nc_cat=108&ccb=1-7&_nc_sid=110474&_nc_ohc=yQVvME9LP38AX_31ohC&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT_ksKEIYmAIYMEm7hu86Dp8aL1gu5BnsoONrAE7iFx1vw&oe=6346CAC6",
//     created_time_ms: 1665028827000,
//     created_time: "2022-10-06T04:00:27+0000",
//     id: "155178547881479_537230501738905",
//     facebook_page: "ie",
//   },
//   {
//     message:
//       "ประกาศ นักศึกษาคนใดลืมนาฬิกาไว้ในห้องน้ำชาย ชั้น 1 ให้มารับคืนได้ที่ห้องธุรการ",
//     message_chars: "ปรกศนกศกษคนดลมนฬกวนหองนชยชนหมรบคนดทหองธรกร",
//     permalink_url:
//       "https://www.facebook.com/606863031228263/posts/604493348131898",
//     full_picture: "",
//     created_time_ms: 1664939588000,
//     created_time: "2022-10-05T03:13:08+0000",
//     id: "152483181547527_604493348131898",
//     facebook_page: "undergradTH",
//   },
//   {
//     message: "",
//     message_chars: "",
//     permalink_url:
//       "https://www.facebook.com/505887591552994/posts/502512491890504",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/309556571_470547578450510_6114846745939902913_n.jpg?stp=dst-jpg_s720x720&_nc_cat=103&ccb=1-7&_nc_sid=8024bb&_nc_ohc=au9TFbjFMb4AX9MRZw3&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT9EVdQm3CRUkLwybrw-VG28Pvf00rLftQyxXezQrA9ReA&oe=63460E19",
//     created_time_ms: 1664852669000,
//     created_time: "2022-10-04T03:04:29+0000",
//     id: "1022747451135009_502512491890504",
//     facebook_page: "grad",
//   },
//   {
//     message: "",
//     message_chars: "",
//     permalink_url:
//       "https://www.facebook.com/606863031228263/posts/603024051612161",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/310721210_123815767125971_9196228321224303009_n.jpg?stp=dst-jpg_s720x720&_nc_cat=108&ccb=1-7&_nc_sid=0be424&_nc_ohc=r_s3zZwmN48AX8hJ04A&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT-KdLMwrvthS1kdGYXQKtWRb0y1Onlv9U0Z0V3ATqRhQw&oe=63477D22",
//     created_time_ms: 1664795557000,
//     created_time: "2022-10-03T11:12:37+0000",
//     id: "152483181547527_603024051612161",
//     facebook_page: "undergradTH",
//   },
//   {
//     message:
//       "การเผยแพร่ผลงานปริญญานิพนธ์ สำหรับนักศึกษาปริญญาเอก สาขาวิชาวิศวกรรมอุตสาหการ https://cmu.to/80nir",
//     message_chars:
//       "กรผยพรผลงนปรญญนพนธสหรบนกศกษปรญญอกสขวชวศวกรรมอตสหกรhttpscmutonir",
//     permalink_url:
//       "https://www.facebook.com/505887591552994/posts/500773465397740",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/310805839_502217698586650_7019430314160859704_n.jpg?stp=dst-jpg_s720x720&_nc_cat=101&ccb=1-7&_nc_sid=8024bb&_nc_ohc=9zMx70z0NSQAX9aYkib&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT9rr65LkiF9oIdxAvHMqyRXUZ3jTDvMyXnUw05YcC0kRw&oe=6347206A",
//     created_time_ms: 1664790607000,
//     created_time: "2022-10-03T09:50:07+0000",
//     id: "1022747451135009_500773465397740",
//     facebook_page: "grad",
//   },
//   {
//     message: "ข่าวรับสมัครงาน",
//     message_chars: "ขวรบสมครงน",
//     permalink_url:
//       "https://www.facebook.com/606863031228263/posts/602861294961770",
//     full_picture:
//       "https://scontent.fcnx4-1.fna.fbcdn.net/v/t39.30808-6/310004229_551783063414888_748875301324722147_n.jpg?stp=dst-jpg_s720x720&_nc_cat=104&ccb=1-7&_nc_sid=110474&_nc_ohc=doY4yT_E1CkAX_Nvluu&_nc_ht=scontent.fcnx4-1.fna&edm=AKK4YLsEAAAA&oh=00_AT-dw1Y7hSLWxH7U-fKy1qfoPEdgk8xXpwRhrBBu4XvUtA&oe=63468B74",
//     created_time_ms: 1664778062000,
//     created_time: "2022-10-03T06:21:02+0000",
//     id: "152483181547527_602861294961770",
//     facebook_page: "undergradTH",
//   },
// ];

// // Sort so that earlier post comes first.
// const dataAllSorted = dataAll.sort(
//   (a, b) => a.created_time_ms - b.created_time_ms
// );

// console.log(dataAll.length);

// // console.log(dataAll.map(el=>el.message.slice(0,20)))

// const picturesIdx = dataAll.map((el) => el.full_picture);

// const dataAllFilt = dataAll.filter((curr, idx) => {
//   if (curr.full_picture) {
//     return picturesIdx.indexOf(curr.full_picture) === idx;
//   } else {
//     // Do not filter if there is no picture.
//     return true;
//   }
// });

// // Sort data sot that later post comes first.
// const dataAllFiltSorted = dataAllFilt.sort(
//   (a, b) => b.created_time_ms - a.created_time_ms
// );

// console.log(dataAllFiltSorted.length);

// console.log(dataAllFiltSorted.map((el) => el.message.slice(0, 20)));
